In [2]:
import duckdb as dd

# Create an in-memory DuckDB connection
con = dd.connect(':memory:')

In [52]:
con = dd.connect('my_database.db')

In [3]:
result = dd.sql("SELECT 'DuckDB_is_cool' AS answer").fetchall()
print(type(result))
print(result)

<class 'list'>
[('DuckDB_is_cool',)]

In [4]:
result = dd.sql("SELECT 'DuckDB_is_cool' AS answer")
print( type(result) )
print(result)

<class 'duckdb.duckdb.DuckDBPyRelation'>
┌────────────────┐
│     answer     │
│    varchar     │
├────────────────┤
│ DuckDB_is_cool │
└────────────────┘

In [5]:
rel = dd.sql("SELECT * FROM range(10_00) AS tbl(ID)")
# Display the relation
rel.show()

┌────────────┐
│     ID     │
│   int64    │
├────────────┤
│          0 │
│          1 │
│          2 │
│          3 │
│          4 │
│          5 │
│          6 │
│          7 │
│          8 │
│          9 │
│          · │
│          · │
│          · │
│        990 │
│        991 │
│        992 │
│        993 │
│        994 │
│        995 │
│        996 │
│        997 │
│        998 │
│        999 │
├────────────┤
│ 1000 rows  │
│ (20 shown) │
└────────────┘

In [53]:
con = dd.connect('my_database.db')
con.sql('SHOW ALL TABLES')

┌─────────────┬─────────┬──────────┬─────────────────────────────────────────────────────────────┬───────────────────────────────────────────────────────────────┬───────────┐
│  database   │ schema  │   name   │                        column_names                         │                         column_types                          │ temporary │
│   varchar   │ varchar │ varchar  │                          varchar[]                          │                           varchar[]                           │  boolean  │
├─────────────┼─────────┼──────────┼─────────────────────────────────────────────────────────────┼───────────────────────────────────────────────────────────────┼───────────┤
│ my_database │ main    │ brands   │ [brandname]                                                 │ [VARCHAR]                                                     │ false     │
│ my_database │ main    │ fuels    │ [fuelcode]                                                  │ [VARCHAR]                                                     │ false     │
│ my_database │ main    │ prices   │ [fuelcode, station, price, updatetime]                      │ [VARCHAR, VARCHAR, DOUBLE, TIMESTAMP]                         │ false     │
│ my_database │ main    │ stations │ [stationname, brand, address, suburb, postalcode, lat, lon] │ [VARCHAR, VARCHAR, VARCHAR, VARCHAR, VARCHAR, DOUBLE, DOUBLE] │ false     │
└─────────────┴─────────┴──────────┴─────────────────────────────────────────────────────────────┴───────────────────────────────────────────────────────────────┴───────────┘

In [11]:
# Create a table
con.execute('''
    CREATE OR REPLACE TABLE countries (
        country VARCHAR,
        code VARCHAR,
        region VARCHAR,
        sub_region VARCHAR,
        intermediate_region VARCHAR);
''')

In [12]:

# Insert some data
con.execute('''
INSERT INTO countries VALUES
('Australia', 'AUS', 'Oceania', 'Australia and New Zealand', ''),
('India', 'IND', 'Asia', 'Southern Asia', '');
''')

con.sql('SHOW ALL TABLES')

┌─────────────┬─────────┬───────────┬──────────────────────────────────────────────────────────┬───────────────────────────────────────────────┬───────────┐
│  database   │ schema  │   name    │                       column_names                       │                 column_types                  │ temporary │
│   varchar   │ varchar │  varchar  │                        varchar[]                         │                   varchar[]                   │  boolean  │
├─────────────┼─────────┼───────────┼──────────────────────────────────────────────────────────┼───────────────────────────────────────────────┼───────────┤
│ my_database │ main    │ countries │ [country, code, region, sub_region, intermediate_region] │ [VARCHAR, VARCHAR, VARCHAR, VARCHAR, VARCHAR] │ false     │
└─────────────┴─────────┴───────────┴──────────────────────────────────────────────────────────┴───────────────────────────────────────────────┴───────────┘

In [14]:
con.execute('''
CREATE OR REPLACE TABLE employees (
    id INTEGER,
    name VARCHAR,
    age INTEGER,
    salary DOUBLE
);
''')

# Insert some data in second table
con.execute('''
INSERT INTO employees VALUES
(1, 'Person 1', 30, 70000),
(2, 'Person 2', 25, 55000),
(3, 'Person 3', 35, 80000);
''')


# Result of showing tables after creating the second table
con.sql('SHOW ALL TABLES')

┌─────────────┬─────────┬───────────┬──────────────────────────────────────────────────────────┬───────────────────────────────────────────────┬───────────┐
│  database   │ schema  │   name    │                       column_names                       │                 column_types                  │ temporary │
│   varchar   │ varchar │  varchar  │                        varchar[]                         │                   varchar[]                   │  boolean  │
├─────────────┼─────────┼───────────┼──────────────────────────────────────────────────────────┼───────────────────────────────────────────────┼───────────┤
│ my_database │ main    │ countries │ [country, code, region, sub_region, intermediate_region] │ [VARCHAR, VARCHAR, VARCHAR, VARCHAR, VARCHAR] │ false     │
│ my_database │ main    │ employees │ [id, name, age, salary]                                  │ [INTEGER, VARCHAR, INTEGER, DOUBLE]           │ false     │
└─────────────┴─────────┴───────────┴──────────────────────────────────────────────────────────┴───────────────────────────────────────────────┴───────────┘

In [15]:
con.sql('SELECT * FROM countries;')

┌───────────┬─────────┬─────────┬───────────────────────────┬─────────────────────┐
│  country  │  code   │ region  │        sub_region         │ intermediate_region │
│  varchar  │ varchar │ varchar │          varchar          │       varchar       │
├───────────┼─────────┼─────────┼───────────────────────────┼─────────────────────┤
│ Australia │ AUS     │ Oceania │ Australia and New Zealand │                     │
│ India     │ IND     │ Asia    │ Southern Asia             │                     │
└───────────┴─────────┴─────────┴───────────────────────────┴─────────────────────┘

In [ ]:
con.sql('''
        SELECT  *
            FROM
                countries
            WHERE
                region = 'Oceania'
                AND sub_region = 'Australia and New Zealand'
''')

┌───────────┬─────────┬─────────┬───────────────────────────┬─────────────────────┐
│  country  │  code   │ region  │        sub_region         │ intermediate_region │
│  varchar  │ varchar │ varchar │          varchar          │       varchar       │
├───────────┼─────────┼─────────┼───────────────────────────┼─────────────────────┤
│ Australia │ AUS     │ Oceania │ Australia and New Zealand │                     │
└───────────┴─────────┴─────────┴───────────────────────────┴─────────────────────┘

In [17]:
countries = con.sql('SELECT * FROM countries;')
countries

┌───────────┬─────────┬─────────┬───────────────────────────┬─────────────────────┐
│  country  │  code   │ region  │        sub_region         │ intermediate_region │
│  varchar  │ varchar │ varchar │          varchar          │       varchar       │
├───────────┼─────────┼─────────┼───────────────────────────┼─────────────────────┤
│ Australia │ AUS     │ Oceania │ Australia and New Zealand │                     │
│ India     │ IND     │ Asia    │ Southern Asia             │                     │
└───────────┴─────────┴─────────┴───────────────────────────┴─────────────────────┘

In [18]:
countries.fetchall()

[('Australia', 'AUS', 'Oceania', 'Australia and New Zealand', ''),
 ('India', 'IND', 'Asia', 'Southern Asia', '')]

In [19]:
countries.to_df()

     country code   region                 sub_region intermediate_region
0  Australia  AUS  Oceania  Australia and New Zealand
1      India  IND     Asia              Southern Asia

In [20]:
import pandas as pd

df = pd.DataFrame({
    'id': [4, 5, 6],
    'name': ['Person 4', 'Person 5', 'Person 6'],
    'age': [45, 40, 35],
    'salary': [100000, 85000, 75000]
})

con.sql('''
        INSERT INTO employees (id, name, age, salary)
        SELECT * FROM df
''')

con.sql('select * from employees')

┌───────┬──────────┬───────┬──────────┐
│  id   │   name   │  age  │  salary  │
│ int32 │ varchar  │ int32 │  double  │
├───────┼──────────┼───────┼──────────┤
│     1 │ Person 1 │    30 │  70000.0 │
│     2 │ Person 2 │    25 │  55000.0 │
│     3 │ Person 3 │    35 │  80000.0 │
│     4 │ Person 4 │    45 │ 100000.0 │
│     5 │ Person 5 │    40 │  85000.0 │
│     6 │ Person 6 │    35 │  75000.0 │
└───────┴──────────┴───────┴──────────┘

In [24]:
con.sql('DROP TABLE IF EXISTS fuels;')

In [28]:
con.sql('SHOW ALL TABLES')

┌─────────────┬─────────┬──────────┬─────────────────────────────────────────────────────────────┬───────────────────────────────────────────────────────────────┬───────────┐
│  database   │ schema  │   name   │                        column_names                         │                         column_types                          │ temporary │
│   varchar   │ varchar │ varchar  │                          varchar[]                          │                           varchar[]                           │  boolean  │
├─────────────┼─────────┼──────────┼─────────────────────────────────────────────────────────────┼───────────────────────────────────────────────────────────────┼───────────┤
│ my_database │ main    │ brands   │ [brandname]                                                 │ [VARCHAR]                                                     │ false     │
│ my_database │ main    │ fuels    │ [fuelcode]                                                  │ [VARCHAR]                                                     │ false     │
│ my_database │ main    │ prices   │ [fuelcode, station, price, updatetime]                      │ [VARCHAR, VARCHAR, DOUBLE, TIMESTAMP]                         │ false     │
│ my_database │ main    │ stations │ [stationname, brand, address, suburb, postalcode, lat, lon] │ [VARCHAR, VARCHAR, VARCHAR, VARCHAR, VARCHAR, DOUBLE, DOUBLE] │ false     │
└─────────────┴─────────┴──────────┴─────────────────────────────────────────────────────────────┴───────────────────────────────────────────────────────────────┴───────────┘

In [17]:
con.execute('''
    CREATE TABLE brands (
        brandname TEXT unique
    );
''')

In [26]:
con.execute('''
    CREATE TABLE fuels (
        fuelcode TEXT unique
    );
''')

In [22]:
con.execute('''
    CREATE TABLE stations (
        stationname TEXT unique,
        brand TEXT REFERENCES brands(brandname),
        address TEXT,
        suburb TEXT,
        postalcode TEXT,
        lat DOUBLE,
        lon DOUBLE,
    );
''')

In [27]:
con.execute('''
    CREATE TABLE prices (
        fuelcode TEXT REFERENCES fuels(fuelcode),
        station TEXT REFERENCES stations(stationname),
        price DOUBLE,
        updatetime TIMESTAMP
    );
''')

In [29]:
import pandas as pd

df = pd.DataFrame({
    'brandname': ['seven eleven'],
})

con.sql('''
        INSERT INTO brands (brandname)
        SELECT * FROM df
''')

In [30]:
con.sql('select * from brands')

┌──────────────┐
│  brandname   │
│   varchar    │
├──────────────┤
│ seven eleven │
└──────────────┘

In [31]:
df = pd.DataFrame({
    'fuelcode': ['94'],
})

con.sql('''
        INSERT INTO fuels (fuelcode)
        SELECT * FROM df
''')

In [51]:
con.sql('select * from fuels')

CatalogException: Catalog Error: Table with name fuels does not exist!
Did you mean "pg_class"?

In [33]:
df = pd.DataFrame({
    'stationname': ['station 1'],
    'brand': ['seven eleven'],
    'address': ['1 brisbane st'],
    'suburb': ['Chifley'],
    'postalcode': ['2036'],
    'lat': [50.300],
    'lon': [20.901],
})

con.sql('''
        INSERT INTO stations (stationname, brand, address, suburb, postalcode, lat, lon)
        SELECT * FROM df
''')

con.sql('select * from stations')

┌─────────────┬──────────────┬───────────────┬─────────┬────────────┬────────┬────────┐
│ stationname │    brand     │    address    │ suburb  │ postalcode │  lat   │  lon   │
│   varchar   │   varchar    │    varchar    │ varchar │  varchar   │ double │ double │
├─────────────┼──────────────┼───────────────┼─────────┼────────────┼────────┼────────┤
│ station 1   │ seven eleven │ 1 brisbane st │ Chifley │ 2036       │   50.3 │ 20.901 │
└─────────────┴──────────────┴───────────────┴─────────┴────────────┴────────┴────────┘

In [37]:
from datetime import datetime

df = pd.DataFrame({
    'station': ['station 1'],
    'fuelcode': ['94'],
    'updatetime': [datetime.now()],
    'price': [210.5],
})

con.sql('''
        INSERT INTO prices (station, fuelcode, updatetime, price)
        SELECT * FROM df
''')

con.sql('select * from prices')

┌──────────┬───────────┬────────┬────────────────────────────┐
│ fuelcode │  station  │ price  │         updatetime         │
│ varchar  │  varchar  │ double │         timestamp          │
├──────────┼───────────┼────────┼────────────────────────────┤
│ 94       │ station 1 │  210.5 │ 2025-04-11 08:36:08.303049 │
│ 94       │ station 1 │  210.5 │ 2025-04-11 08:36:43.802418 │
└──────────┴───────────┴────────┴────────────────────────────┘

In [55]:
import duckdb
import graphviz


tables = con.sql("""
    SHOW ALL TABLES;
""").fetchall()

tables

[('my_database', 'main', 'brands', ['brandname'], ['VARCHAR'], False),
 ('my_database', 'main', 'fuels', ['fuelcode'], ['VARCHAR'], False),
 ('my_database',
  'main',
  'prices',
  ['fuelcode', 'station', 'price', 'updatetime'],
  ['VARCHAR', 'VARCHAR', 'DOUBLE', 'TIMESTAMP'],
  False),
 ('my_database',
  'main',
  'stations',
  ['stationname', 'brand', 'address', 'suburb', 'postalcode', 'lat', 'lon'],
  ['VARCHAR', 'VARCHAR', 'VARCHAR', 'VARCHAR', 'VARCHAR', 'DOUBLE', 'DOUBLE'],
  False)]